results/pro6000_h100_h200_b200_01_2026/h200/exp2_baseline_qwen3/h200_x_8_QuantTrio_Qwen3-Coder-480B-A35B-Instruct-AWQ_vllm_benchmark.txt
============ Serving Benchmark Result ============
Successful requests:                     128       
Failed requests:                         0         
Maximum request concurrency:             64        
Benchmark duration (s):                  606.72    
Total input tokens:                      1024000   
Total generated tokens:                  1024000   
Request throughput (req/s):              0.21      
Output token throughput (tok/s):         1687.77   
Peak output token throughput (tok/s):    2502.00   
Peak concurrent requests:                75.00     
Total token throughput (tok/s):          3375.53   
---------------Time to First Token----------------
Mean TTFT (ms):                          9252.78   
Median TTFT (ms):                        6684.43   
P99 TTFT (ms):                           31040.76  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          31.77     
Median TPOT (ms):                        34.35     
P99 TPOT (ms):                           39.65     
---------------Inter-token Latency----------------
Mean ITL (ms):                           31.77     
Median ITL (ms):                         32.27     
P99 ITL (ms):                            41.84     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          263373.50 
Median E2EL (ms):                        282133.66 
P99 E2EL (ms):                           326796.46 
==================================================

============ Docker Compose Configuration ============
services:
  vllm_0:
    image: vllm/vllm-openai:latest
    container_name: vllm_benchmark_container_0
    deploy:
      resources:
        reservations:
          devices:
            - driver: nvidia
              device_ids: ['0', '1', '2', '3']
              capabilities: [gpu]
    volumes:
      - /mnt/localssd/hf_models:/mnt/localssd/hf_models
    environment:
      - HUGGING_FACE_HUB_TOKEN=
      - HF_HOME=/mnt/localssd/hf_models
    ports:
      - "8000:8000"
    shm_size: '16gb'
    ipc: host
    command: >
      --trust-remote-code
      --gpu-memory-utilization=0.9
      --host 0.0.0.0
      --port 8000
      --tensor-parallel-size 4
      --pipeline-parallel-size 1
      --model /mnt/localssd/hf_models/QuantTrio/Qwen3-Coder-480B-A35B-Instruct-AWQ
      --served-model-name QuantTrio/Qwen3-Coder-480B-A35B-Instruct-AWQ
      --max-num-seqs 512 --max-model-len 16384
    healthcheck:
      test: ["CMD", "bash", "-c", "curl -f http://localhost:8000/health && curl -f http://localhost:8000/v1/models | grep -q 'object.*list'"]
      interval: 10s
      timeout: 10s
      retries: 180
      start_period: 600s

  vllm_1:
    image: vllm/vllm-openai:latest
    container_name: vllm_benchmark_container_1
    deploy:
      resources:
        reservations:
          devices:
            - driver: nvidia
              device_ids: ['4', '5', '6', '7']
              capabilities: [gpu]
    volumes:
      - /mnt/localssd/hf_models:/mnt/localssd/hf_models
    environment:
      - HUGGING_FACE_HUB_TOKEN=
      - HF_HOME=/mnt/localssd/hf_models
    ports:
      - "8001:8000"
    shm_size: '16gb'
    ipc: host
    command: >
      --trust-remote-code
      --gpu-memory-utilization=0.9
      --host 0.0.0.0
      --port 8000
      --tensor-parallel-size 4
      --pipeline-parallel-size 1
      --model /mnt/localssd/hf_models/QuantTrio/Qwen3-Coder-480B-A35B-Instruct-AWQ
      --served-model-name QuantTrio/Qwen3-Coder-480B-A35B-Instruct-AWQ
      --max-num-seqs 512 --max-model-len 16384
    healthcheck:
      test: ["CMD", "bash", "-c", "curl -f http://localhost:8000/health && curl -f http://localhost:8000/v1/models | grep -q 'object.*list'"]
      interval: 10s
      timeout: 10s
      retries: 180
      start_period: 600s

  nginx:
    image: nginx:alpine
    container_name: nginx_lb
    ports:
      - "8080:8080"
    volumes:
      - /home/natalia/server-benchmark/nginx.vllm.conf:/etc/nginx/nginx.conf:ro
    depends_on:
      - vllm_0
      - vllm_1

  benchmark:
    image: vllm/vllm-openai:latest
    container_name: vllm_benchmark_client
    volumes:
      - /mnt/localssd/hf_models:/mnt/localssd/hf_models
    environment:
      - HUGGING_FACE_HUB_TOKEN=
      - HF_HOME=/mnt/localssd/hf_models
    entrypoint: ["/bin/bash", "-c"]
    command: ["sleep infinity"]
    profiles:
      - tools

============ Benchmark Command ============
vllm bench serve     --model QuantTrio/Qwen3-Coder-480B-A35B-Instruct-AWQ     --dataset-name random     --random-input-len 8000     --random-output-len 8000     --max-concurrency 64     --num-prompts 128     --ignore-eos     --backend openai-chat     --endpoint /v1/chat/completions     --percentile-metrics ttft,tpot,itl,e2el     --base-url http://nginx_lb:8080
==================================================